# ch03. quiz1

In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

## 데이터 분석 시작 루틴

- 1.데이터셋을 처음 관찰할 때 수행하는 일련의 루틴은 다음과 같습니다.
    - 데이터셋을 읽을 후 head() 메서드를 사용해 처음 다섯 줄을 살펴본다.
    - shape attribute를 사용하여 DataFrmae의 모양을 확인한다.
    - info() 메서드를 사용하여 각 col의 data type, 누락값 개수, 메모리 사용량 등을 확인한다.
    - 숫자 col의 요약 통계량을 구한 후 가독성을 위해 transpose 시킨다.
    - object, category col에 대한 요약 통계량을 구한다.
    
- 대학 데이터셋을 이용하여 위 과정을 진행하세요.

In [2]:
college = pd.read_csv('../data/college.csv')

In [3]:
college.head()

,INSTNM,CITY,STABBR,HBCU,MENONLY,WOMENONLY,RELAFFIL,SATVRMID,SATMTMID,DISTANCEONLY,...,UGDS_2MOR,UGDS_NRA,UGDS_UNKN,PPTUG_EF,CURROPER,PCTPELL,PCTFLOAN,UG25ABV,MD_EARN_WNE_P10,GRAD_DEBT_MDN_SUPP
0,Alabama A & M University,Normal,AL,1.0,0.0,0.0,0,424.0,420.0,0.0,...,0.0000,0.0059,0.0138,0.0656,1,0.7356,0.8284,0.1049,30300,33888
1,University of Alabama at Birmingham,Birmingham,AL,0.0,0.0,0.0,0,570.0,565.0,0.0,...,0.0368,0.0179,0.0100,0.2607,1,0.3460,0.5214,0.2422,39700,21941.5
2,Amridge University,Montgomery,AL,0.0,0.0,0.0,1,NaN,NaN,1.0,...,0.0000,0.0000,0.2715,0.4536,1,0.6801,0.7795,0.8540,40100,23370
3,University of Alabama in Huntsville,Huntsville,AL,0.0,0.0,0.0,0,595.0,590.0,0.0,...,0.0172,0.0332,0.0350,0.2146,1,0.3072,0.4596,0.2640,45500,24097
4,Alabama State University,Montgomery,AL,1.0,0.0,0.0,0,425.0,430.0,0.0,...,0.0098,0.0243,0.0137,0.0892,1,0.7347,0.7554,0.1270,26600,33118.5

In [4]:
college.shape

(7535, 27)

In [5]:
college.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7535 entries, 0 to 7534
Data columns (total 27 columns):
INSTNM                7535 non-null object
CITY                  7535 non-null object
STABBR                7535 non-null object
HBCU                  7164 non-null float64
MENONLY               7164 non-null float64
WOMENONLY             7164 non-null float64
RELAFFIL              7535 non-null int64
SATVRMID              1185 non-null float64
SATMTMID              1196 non-null float64
DISTANCEONLY          7164 non-null float64
UGDS                  6874 non-null float64
UGDS_WHITE            6874 non-null float64
UGDS_BLACK            6874 non-null float64
UGDS_HISP             6874 non-null float64
UGDS_ASIAN            6874 non-null float64
UGDS_AIAN             6874 non-null float64
UGDS_NHPI             6874 non-null float64
UGDS_2MOR             6874 non-null float64
UGDS_NRA              6874 non-null float64
UGDS_UNKN             6874 non-null float64
PPTUG_EF              6853 non-null float64
CURROPER              7535 non-null int64
PCTPELL               6849 non-null float64
PCTFLOAN              6849 non-null float64
UG25ABV               6718 non-null float64
MD_EARN_WNE_P10       6413 non-null object
GRAD_DEBT_MDN_SUPP    7503 non-null object
dtypes: float64(20), int64(2), object(5)
memory usage: 1.4+ MB

In [6]:
college.describe(include='number').T

,count,mean,std,min,25%,50%,75%,max
HBCU,7164.0,0.014238,0.118478,0.0,0.000000,0.00000,0.000000,1.0000
MENONLY,7164.0,0.009213,0.095546,0.0,0.000000,0.00000,0.000000,1.0000
WOMENONLY,7164.0,0.005304,0.072642,0.0,0.000000,0.00000,0.000000,1.0000
RELAFFIL,7535.0,0.190975,0.393096,0.0,0.000000,0.00000,0.000000,1.0000
SATVRMID,1185.0,522.819409,68.578862,290.0,475.000000,510.00000,555.000000,765.0000
SATMTMID,1196.0,530.765050,73.469767,310.0,482.000000,520.00000,565.000000,785.0000
DISTANCEONLY,7164.0,0.005583,0.074519,0.0,0.000000,0.00000,0.000000,1.0000
UGDS,6874.0,2356.837940,5474.275871,0.0,117.000000,412.50000,1929.500000,151558.0000
UGDS_WHITE,6874.0,0.510207,0.286958,0.0,0.267500,0.55570,0.747875,1.0000
UGDS_BLACK,6874.0,0.189997,0.224587,0.0,0.036125,0.10005,0.257700,1.0000
UGDS_HISP,6874.0,0.161635,0.221854,0.0,0.027600,0.07140,0.198875,1.0000
UGDS_ASIAN,6874.0,0.033544,0.073777,0.0,0.002500,0.01290,0.032700,0.9727
UGDS_AIAN,6874.0,0.013813,0.070196,0.0,0.000000,0.00260,0.007300,1.0000
UGDS_NHPI,6874.0,0.004569,0.033125,0.0,0.000000,0.00000,0.002500,0.9983
UGDS_2MOR,6874.0,0.023950,0.031288,0.0,0.000000,0.01750,0.033900,0.5333
UGDS_NRA,6874.0,0.016086,0.050172,0.0,0.000000,0.00000,0.011700,0.9286
UGDS_UNKN,6874.0,0.045181,0.093440,0.0,0.000000,0.01430,0.045400,0.9027
PPTUG_EF,6853.0,0.226639,0.246470,0.0,0.000000,0.15040,0.376900,1.0000
CURROPER,7535.0,0.923291,0.266146,0.0,1.000000,1.00000,1.000000,1.0000
PCTPELL,6849.0,0.530643,0.225544,0.0,0.357800,0.52150,0.712900,1.0000
PCTFLOAN,6849.0,0.522211,0.283616,0.0,0.332900,0.58330,0.745000,1.0000
UG25ABV,6718.0,0.410021,0.228939,0.0,0.241500,0.40075,0.572275,1.0000

In [7]:
college.describe(include='object').T

                   count unique                          top  freq
INSTNM              7535   7535  Hays Academy of Hair Design     1
CITY                7535   2514                     New York    87
STABBR              7535     59                           CA   773
MD_EARN_WNE_P10     6413    598            PrivacySuppressed   822
GRAD_DEBT_MDN_SUPP  7503   2038            PrivacySuppressed  1510

- The freq is the most common value’s frequency.

## 데이터 형식을 변경해 메모리 절약

- 2.college DataFrmae에서 RELAFFIL, INSTNM, STABBR을 복사하여 메모리 사용량을 확인하세요.

In [8]:
college = pd.read_csv('../data/college.csv')

In [9]:
cols = ['RELAFFIL', 'INSTNM', 'STABBR']

In [10]:
college2 = college.loc[:, cols]

In [11]:
college2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7535 entries, 0 to 7534
Data columns (total 3 columns):
RELAFFIL    7535 non-null int64
INSTNM      7535 non-null object
STABBR      7535 non-null object
dtypes: int64(1), object(2)
memory usage: 117.8+ KB

In [12]:
college2.memory_usage(deep=True)

Index           40
RELAFFIL     60280
INSTNM      449092
STABBR      233585
dtype: int64

In [13]:
college2.head()

   RELAFFIL                               INSTNM STABBR
0         0             Alabama A & M University     AL
1         0  University of Alabama at Birmingham     AL
2         1                   Amridge University     AL
3         0  University of Alabama in Huntsville     AL
4         0             Alabama State University     AL

In [14]:
college2.dtypes

RELAFFIL     int64
INSTNM      object
STABBR      object
dtype: object

2-1. RELAFFIL col은 0/1 값만을 가지므로 int64일 필요가 없습니다.
- int8로 변환하고 용량을 확인하세요.

In [15]:
college2['RELAFFIL'] = college2['RELAFFIL'].astype('int8')

In [16]:
college2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7535 entries, 0 to 7534
Data columns (total 3 columns):
RELAFFIL    7535 non-null int8
INSTNM      7535 non-null object
STABBR      7535 non-null object
dtypes: int8(1), object(2)
memory usage: 66.3+ KB

In [17]:
college2.memory_usage(deep=True)

Index           40
RELAFFIL      7535
INSTNM      449092
STABBR      233585
dtype: int64

2-2. STABBR col의 데이터를 확인한 후 Categorical 로 변경하고 메모리 사용량을 확인하세요.

In [18]:
college2.select_dtypes(include='object').nunique()

INSTNM    7535
STABBR      59
dtype: int64

In [19]:
college2['STABBR'] = college2['STABBR'].astype('category')

In [20]:
college2.dtypes

RELAFFIL        int8
INSTNM        object
STABBR      category
dtype: object

In [21]:
college2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7535 entries, 0 to 7534
Data columns (total 3 columns):
RELAFFIL    7535 non-null int8
INSTNM      7535 non-null object
STABBR      7535 non-null category
dtypes: category(1), int8(1), object(1)
memory usage: 45.9+ KB

In [22]:
college2.memory_usage(deep=True)

Index           40
RELAFFIL      7535
INSTNM      449551
STABBR       10900
dtype: int64

In [23]:
college2['STABBR'].head()

0    AL
1    AL
2    AL
3    AL
4    AL
Name: STABBR, dtype: category
Categories (59, object): [AK, AL, AR, AS, ..., WA, WI, WV, WY]

- 2-3. 기존 대비 용량이 얼마나 줄었는지 확인하세요.

In [24]:
new_memory = college2.memory_usage(deep=True)

In [25]:
new_memory

Index           40
RELAFFIL      7535
INSTNM      449551
STABBR       10900
dtype: int64

In [26]:
orig_memory = college.loc[:, cols].memory_usage(deep=True)

In [27]:
orig_memory

Index           40
RELAFFIL     60280
INSTNM      449551
STABBR      233585
dtype: int64

In [28]:
new_memory / orig_memory

Index       1.000000
RELAFFIL    0.125000
INSTNM      1.000000
STABBR      0.046664
dtype: float64

## 최대, 최소 선택

- 3.영화 데이터셋을 읽어 평점(imdb_score)이 가장 좋은 영화 100개를 선택하세요.

In [29]:
movie = pd.read_csv('../data/movie.csv')

In [30]:
movie2 = movie[['movie_title', 'imdb_score']]

In [31]:
movie2.head()

                                  movie_title  imdb_score
0                                      Avatar         7.9
1    Pirates of the Caribbean: At World's End         7.1
2                                     Spectre         6.8
3                       The Dark Knight Rises         8.5
4  Star Wars: Episode VII - The Force Awakens         7.1

### sort_values

In [32]:
top100_score = movie2.sort_values('imdb_score', ascending=False).head(100)

In [33]:
top100_score.head()

                   movie_title  imdb_score
2725          Towering Inferno         9.5
1920  The Shawshank Redemption         9.3
3402             The Godfather         9.2
2779                   Dekalog         9.1
4312      Kickboxer: Vengeance         9.1

### nlargest

In [34]:
top100_score2 = movie2.nlargest(100, 'imdb_score')

In [35]:
top100_score2.head()

                   movie_title  imdb_score
2725          Towering Inferno         9.5
1920  The Shawshank Redemption         9.3
3402             The Godfather         9.2
2779                   Dekalog         9.1
4312      Kickboxer: Vengeance         9.1

- 3-1. 평점(imdb_score)이 가장 높은 영화 중에서 최저 예산(budget) 5개를 선별하세요.

In [36]:
movie3 = movie[['movie_title', 'imdb_score', 'budget']]

In [37]:
movie3.head()

                                  movie_title  imdb_score       budget
0                                      Avatar         7.9  237000000.0
1    Pirates of the Caribbean: At World's End         7.1  300000000.0
2                                     Spectre         6.8  245000000.0
3                       The Dark Knight Rises         8.5  250000000.0
4  Star Wars: Episode VII - The Force Awakens         7.1          NaN

###  sort_values

In [38]:
high_score_low_budget = movie3.sort_values('imdb_score', ascending=False).head(100)\
                                .sort_values('budget').head(5)

In [39]:
high_score_low_budget

                    movie_title  imdb_score    budget
4815  A Charlie Brown Christmas         8.4  150000.0
4801         Children of Heaven         8.5  180000.0
4804             Butterfly Girl         8.7  180000.0
4706               12 Angry Men         8.9  350000.0
4636       The Other Dream Team         8.4  500000.0

### nlargest, nsmallest

In [40]:
high_score_low_budget2 = movie3.nlargest(100, 'imdb_score').nsmallest(5, 'budget')

In [41]:
high_score_low_budget2

               movie_title  imdb_score    budget
4804        Butterfly Girl         8.7  180000.0
4801    Children of Heaven         8.5  180000.0
4706          12 Angry Men         8.9  350000.0
4550          A Separation         8.4  500000.0
4636  The Other Dream Team         8.4  500000.0

## 정렬을 통한 각 그룹에서 최대, 최소

- 4.각 연도(title_year)의 최고 평점(imdb_score) 영화를 선별하세요. (평점이 동일할 경우 제목(movie_title) 순으로)

In [42]:
movie = pd.read_csv('../data/movie.csv')

In [43]:
movie2 = movie[['movie_title', 'title_year', 'imdb_score']]

In [44]:
movie2.head()

                                  movie_title  title_year  imdb_score
0                                      Avatar      2009.0         7.9
1    Pirates of the Caribbean: At World's End      2007.0         7.1
2                                     Spectre      2015.0         6.8
3                       The Dark Knight Rises      2012.0         8.5
4  Star Wars: Episode VII - The Force Awakens         NaN         7.1

In [45]:
year_best_score_movie = movie2.sort_values(['title_year', 'imdb_score', 'movie_title'], ascending=[True, False, True])

In [46]:
year_best_score_movie.head(10)

                                           movie_title  title_year  imdb_score
4695  Intolerance: Love's Struggle Throughout the Ages      1916.0         8.0
4833                    Over the Hill to the Poorhouse      1920.0         4.8
4767                                    The Big Parade      1925.0         8.3
2694                                        Metropolis      1927.0         8.3
4555                                     Pandora's Box      1929.0         8.0
4697                               The Broadway Melody      1929.0         6.3
3882                                     Hell's Angels      1930.0         7.8
3684                                A Farewell to Arms      1932.0         6.6
4671                                       42nd Street      1933.0         7.7
4779                                She Done Him Wrong      1933.0         6.5

In [47]:
year_best_score_movie = year_best_score_movie.drop_duplicates('title_year')

In [48]:
year_best_score_movie.head(10)

                                           movie_title  title_year  imdb_score
4695  Intolerance: Love's Struggle Throughout the Ages      1916.0         8.0
4833                    Over the Hill to the Poorhouse      1920.0         4.8
4767                                    The Big Parade      1925.0         8.3
2694                                        Metropolis      1927.0         8.3
4555                                     Pandora's Box      1929.0         8.0
3882                                     Hell's Angels      1930.0         7.8
3684                                A Farewell to Arms      1932.0         6.6
4671                                       42nd Street      1933.0         7.7
4708                             It Happened One Night      1934.0         8.2
4594                                           Top Hat      1935.0         7.8

In [49]:
year_best_score_movie.shape

(92, 3)

In [50]:
year_best_score_movie['title_year'].nunique()

91

In [51]:
year_best_score_movie.tail()

                                  movie_title  title_year  imdb_score
3935  Batman: The Dark Knight Returns, Part 2      2013.0         8.4
4804                           Butterfly Girl      2014.0         8.7
3745                          Running Forever      2015.0         8.6
4312                     Kickboxer: Vengeance      2016.0         9.1
2725                         Towering Inferno         NaN         9.5